{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "units": 100, "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 42], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 7, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}